/*
题目描述：
输入正整数 n，输出一个与之对应的 n 阶回转折叠矩阵。

输入描述
多组输入，每组输入一个正整数 n，占一行，其中 n <= 500。

输出描述
输出一个 n 阶回转折叠矩阵，每列的元素之间用一个空格分开，第 1 列的前面和最后一列的后面没有多余的空格。

例如，n = 5 时的回转折叠矩阵为：

 1  2  9 10 25
 4  3  8 11 24
 5  6  7 12 23
16 15 14 13 22
17 18 19 20 21
样例输入：
3
5

样例输出：
1 2 9
4 3 8
5 6 7
1 2 9 10 25
4 3 8 11 24
5 6 7 12 23
16 15 14 13 22
17 18 19 20 21
*/

#include<iostream>

using namespace std;

int a[505][505];

int main()
{
	int n;
	while (cin >> n)
	{
		int m = 1, j = 0, k = 0;
		a[0][0] = m;
		for (int i = 1; i < n; i++)
		{
			if (i % 2 == 1)
			{
				k = i;
				for (j = 0; j <= i; j++)
				{
					a[j][k] = ++m;
				}
				j--;
				for (k = k - 1; k >= 0; k--)
				{
					a[j][k] = ++m;
				}
			}
			else
			{
				j = i;
				for (k = 0; k <= i; k++)
				{
					a[j][k] = ++m;
				}
				k--;
				for (j = j - 1; j >= 0; j--)
				{
					a[j][k] = ++m;
				}
			}
		}
		for (int i = 0; i < n; i++)
		{
			for (int j = 0; j < n; j++)
			{
				cout << a[i][j] << " ";
			}
			cout << endl;
		}
	}
	return 0;
}